FROM python:3.7-alpine
MAINTAINER Alex Linus

#Говорит питону запускаться в Unbuffered mode. Что рекомендуемтся докером.
#Говорит питону чтобы он не буферизовал outputs(выходные данные). так рекомендуется

ENV PYTHONUNBUFFERED 1

COPY ./requirements.txt /requirements.txt
RUN pip install -r /requirements.txt

#Создаем пустую директорию в нашем docker image
RUN mkdir /app
#Переключаем эту папку, как дефолтную директорию, все applications которые мы запускаем в нашем докер контейнере
# Мы запускаем с этого пути (папки)
WORKDIR /app

#Копируем с нашей локальной машины папку app, в папку app на нашем докер контейнере.
COPY ./app /app

#Создаем пользователя, который будет запускать приложения в докере
# -D означает, что создать пользователя, который будет использовать только для запуска приложений
# То есть чисто для запуска, не для создания home директории этого пользователя, без логирования и т.д.
# Только для запуска процессов связанных с нашим докером.
RUN adduser -D alexlinus
#Переключаем наш докер контейнер на юзера USER alexlinus
USER alexlinus

#P.S. Ассоциация с юзерами, делается для security причин. Иначе контейнер будет использоваться из под root usera
# Что не рекомендуется.